experiment/raw/recreate_run4_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 3.402ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.215ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    78.09ms  357.47ms   2.68s    95.62%
    Req/Sec     2.63     21.34   555.00     98.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.73ms
 75.000%    3.76ms
 90.000%    5.21ms
 99.000%    2.02s 
 99.900%    2.43s 
 99.990%    2.68s 
 99.999%    2.68s 
100.000%    2.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.821     0.000000            1         1.00
       1.567     0.100000           55         1.11
       1.935     0.200000          110         1.25
       2.179     0.300000          165         1.43
       2.459     0.400000          220         1.67
       2.729     0.500000          274         2.00
       2.907     0.550000          302         2.22
       3.075     0.600000          329         2.50
       3.321     0.650000          357         2.86
       3.495     0.700000          384         3.33
       3.761     0.750000          411         4.00
       3.979     0.775000          425         4.44
       4.151     0.800000          439         5.00
       4.255     0.825000          453         5.71
       4.503     0.850000          466         6.67
       4.779     0.875000          480         8.00
       4.935     0.887500          487         8.89
       5.347     0.900000          494        10.00
       6.171     0.912500          501        11.43
       7.299     0.925000          507        13.33
       9.367     0.937500          514        16.00
      11.303     0.943750          518        17.78
     269.823     0.950000          521        20.00
     657.407     0.956250          525        22.86
    1082.367     0.962500          528        26.67
    1225.727     0.968750          532        32.00
    1455.103     0.971875          533        35.56
    1478.655     0.975000          535        40.00
    1865.727     0.978125          537        45.71
    1881.087     0.981250          538        53.33
    2004.991     0.984375          540        64.00
    2020.351     0.985938          542        71.11
    2020.351     0.987500          542        80.00
    2024.447     0.989062          543        91.43
    2024.447     0.990625          543       106.67
    2025.471     0.992188          544       128.00
    2252.799     0.992969          545       142.22
    2252.799     0.993750          545       160.00
    2254.847     0.994531          546       182.86
    2254.847     0.995313          546       213.33
    2254.847     0.996094          546       256.00
    2426.879     0.996484          547       284.44
    2426.879     0.996875          547       320.00
    2426.879     0.997266          547       365.71
    2426.879     0.997656          547       426.67
    2426.879     0.998047          547       512.00
    2680.831     0.998242          548       568.89
    2680.831     1.000000          548          inf
#[Mean    =       78.093, StdDeviation   =      357.474]
#[Max     =     2678.784, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 145.50KB read
  Non-2xx or 3xx responses: 20
Requests/sec:      5.02
Transfer/sec:      1.21KB