experiment/raw/recreate_run5_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 3.049ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.154ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.42s     6.36s   24.79s    85.40%
    Req/Sec     3.10     24.13   700.00     97.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.19ms
 75.000%    3.36s 
 90.000%   14.94s 
 99.000%   23.63s 
 99.900%   24.40s 
 99.990%   24.81s 
 99.999%   24.81s 
100.000%   24.81s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.171     0.000000            1         1.00
       1.957     0.100000           55         1.11
       2.331     0.200000          110         1.25
       2.705     0.300000          165         1.43
       3.157     0.400000          220         1.67
       4.187     0.500000          275         2.00
       4.943     0.550000          302         2.22
       6.623     0.600000          329         2.50
    1204.223     0.650000          358         2.86
    2138.111     0.700000          384         3.33
    3364.863     0.750000          411         4.00
    4118.527     0.775000          425         4.44
    5083.135     0.800000          439         5.00
    7335.935     0.825000          453         5.71
    9699.327     0.850000          466         6.67
   12075.007     0.875000          480         8.00
   13574.143     0.887500          487         8.89
   15065.087     0.900000          494        10.00
   16474.111     0.912500          501        11.43
   17465.343     0.925000          507        13.33
   18841.599     0.937500          514        16.00
   19415.039     0.943750          518        17.78
   20103.167     0.950000          521        20.00
   20660.223     0.956250          525        22.86
   20938.751     0.962500          528        26.67
   21692.415     0.968750          531        32.00
   22200.319     0.971875          533        35.56
   22478.847     0.975000          535        40.00
   22527.999     0.978125          537        45.71
   22953.983     0.981250          538        53.33
   23216.127     0.984375          540        64.00
   23314.431     0.985938          541        71.11
   23511.039     0.987500          542        80.00
   23625.727     0.989062          544        91.43
   23625.727     0.990625          544       106.67
   23625.727     0.992188          544       128.00
   24084.479     0.992969          545       142.22
   24084.479     0.993750          545       160.00
   24297.471     0.994531          546       182.86
   24297.471     0.995313          546       213.33
   24297.471     0.996094          546       256.00
   24395.775     0.996484          547       284.44
   24395.775     0.996875          547       320.00
   24395.775     0.997266          547       365.71
   24395.775     0.997656          547       426.67
   24395.775     0.998047          547       512.00
   24805.375     0.998242          548       568.89
   24805.375     1.000000          548          inf
#[Mean    =     3418.199, StdDeviation   =     6364.578]
#[Max     =    24788.992, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 146.86KB read
  Non-2xx or 3xx responses: 38
Requests/sec:      5.02
Transfer/sec:      1.22KB