experiment/raw/recreate_run6_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 4.620ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 5.212ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    73.34ms  333.37ms   2.27s    95.26%
    Req/Sec     2.59     19.32   500.00     97.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.22ms
 75.000%    4.63ms
 90.000%    6.40ms
 99.000%    2.03s 
 99.900%    2.27s 
 99.990%    2.27s 
 99.999%    2.27s 
100.000%    2.27s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.743     0.000000            1         1.00
       1.817     0.100000           56         1.11
       2.165     0.200000          110         1.25
       2.455     0.300000          165         1.43
       2.797     0.400000          220         1.67
       3.223     0.500000          274         2.00
       3.413     0.550000          302         2.22
       3.723     0.600000          329         2.50
       3.895     0.650000          357         2.86
       4.287     0.700000          384         3.33
       4.627     0.750000          411         4.00
       4.803     0.775000          425         4.44
       5.059     0.800000          439         5.00
       5.263     0.825000          453         5.71
       5.579     0.850000          466         6.67
       5.947     0.875000          480         8.00
       6.123     0.887500          487         8.89
       6.423     0.900000          494        10.00
       7.207     0.912500          501        11.43
       8.015     0.925000          507        13.33
       9.535     0.937500          514        16.00
      12.615     0.943750          518        17.78
     385.535     0.950000          521        20.00
     488.703     0.956250          525        22.86
     673.279     0.962500          528        26.67
    1231.871     0.968750          531        32.00
    1235.967     0.971875          533        35.56
    1472.511     0.975000          536        40.00
    1495.039     0.978125          537        45.71
    1720.319     0.981250          538        53.33
    2003.967     0.984375          542        64.00
    2003.967     0.985938          542        71.11
    2003.967     0.987500          542        80.00
    2030.591     0.989062          543        91.43
    2030.591     0.990625          543       106.67
    2033.663     0.992188          544       128.00
    2034.687     0.992969          545       142.22
    2034.687     0.993750          545       160.00
    2265.087     0.994531          546       182.86
    2265.087     0.995313          546       213.33
    2265.087     0.996094          546       256.00
    2269.183     0.996484          547       284.44
    2269.183     0.996875          547       320.00
    2269.183     0.997266          547       365.71
    2269.183     0.997656          547       426.67
    2269.183     0.998047          547       512.00
    2271.231     0.998242          548       568.89
    2271.231     1.000000          548          inf
#[Mean    =       73.338, StdDeviation   =      333.366]
#[Max     =     2269.184, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 145.74KB read
  Non-2xx or 3xx responses: 24
Requests/sec:      5.02
Transfer/sec:      1.21KB