experiment/raw/recreate_run7_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 3.885ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.497ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   167.09ms  633.60ms   4.41s    93.07%
    Req/Sec     2.63     21.05   500.00     98.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.88ms
 75.000%    5.13ms
 90.000%    8.45ms
 99.000%    3.30s 
 99.900%    4.41s 
 99.990%    4.41s 
 99.999%    4.41s 
100.000%    4.41s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.848     0.000000            1         1.00
       2.525     0.100000           56         1.11
       2.929     0.200000          110         1.25
       3.283     0.300000          165         1.43
       3.513     0.400000          220         1.67
       3.877     0.500000          274         2.00
       3.995     0.550000          302         2.22
       4.267     0.600000          329         2.50
       4.439     0.650000          357         2.86
       4.763     0.700000          384         3.33
       5.131     0.750000          412         4.00
       5.331     0.775000          425         4.44
       5.547     0.800000          439         5.00
       5.899     0.825000          453         5.71
       6.367     0.850000          467         6.67
       7.127     0.875000          480         8.00
       7.779     0.887500          487         8.89
       8.935     0.900000          494        10.00
      48.767     0.912500          501        11.43
     416.255     0.925000          507        13.33
    1216.511     0.937500          514        16.00
    1225.727     0.943750          518        17.78
    1681.407     0.950000          521        20.00
    2002.943     0.956250          525        22.86
    2021.375     0.962500          528        26.67
    2023.423     0.968750          531        32.00
    2426.879     0.971875          533        35.56
    2498.559     0.975000          535        40.00
    2818.047     0.978125          537        45.71
    2820.095     0.981250          538        53.33
    3071.999     0.984375          540        64.00
    3205.119     0.985938          542        71.11
    3205.119     0.987500          542        80.00
    3297.279     0.989062          543        91.43
    3297.279     0.990625          543       106.67
    3614.719     0.992188          544       128.00
    3616.767     0.992969          545       142.22
    3616.767     0.993750          545       160.00
    4093.951     0.994531          546       182.86
    4093.951     0.995313          546       213.33
    4093.951     0.996094          546       256.00
    4407.295     0.996484          547       284.44
    4407.295     0.996875          547       320.00
    4407.295     0.997266          547       365.71
    4407.295     0.997656          547       426.67
    4407.295     0.998047          547       512.00
    4411.391     0.998242          548       568.89
    4411.391     1.000000          548          inf
#[Mean    =      167.088, StdDeviation   =      633.603]
#[Max     =     4407.296, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 146.19KB read
  Non-2xx or 3xx responses: 29
Requests/sec:      5.02
Transfer/sec:      1.22KB